// 1. 引入db.js文件
// ===========================================================
// ======  模块名称：引入db.js文件
// ======  模块作用：
// ======       1.连接数据库对应集合
// ======       2.关于连接、关闭、异常的输出模块
// ============================================================
require("./module/db.js");

// 2. 引入crud.js文件
// ===========================================================
// ======  模块名称：引入crud.js文件
// ======  模块作用：
// ======       1.crud.js文件内含model.js文件，用于定义数据模型
// ======       2.关于增删改查的系列操作
// ======       3.一般的逻辑程序会在此文件中进行修改
// ============================================================
require("./module/crud.js");

//第01步：安装依赖
// npm install mongoose

//第02步：运行程序
// node 01-main.js
